import React from "react";
import Marquee from "react-fast-marquee";

const LatestNews = () => {
    return (
        <div className="flex items-center gap-5 bg-base-200 p-3">
            <p className="text-base-100 bg-secondary px-5 py-2">অফার</p>

            <Marquee className="flex gap-5" pauseOnHover={true} speed={60}>
                <p>🎉🎉 শিশুদের জন্য নিয়ে এলাম এক দুর্দান্ত অফার! 🧸
                    আপনার প্রিয় Kids Toy Store-এ চলছে ২০% ছাড়ের মহা উৎসব!
                    রঙিন পুতুল, গাড়ি, পাজল, রোবট— সব খেলনাতেই অবিশ্বাস্য ছাড়! 🚗🤖
                    ছোটদের মুখে হাসি ফোটাতে আজই কিনে ফেলুন তাদের প্রিয় খেলনা 💖
                    ⏰ অফারটি সীমিত সময়ের জন্য — দেরি না করে চলে আসুন এখনই!</p>
            </Marquee>
        </div>
    );
};

export default LatestNews;